; domain
(define (domain floods)
  (:requirements :typing)
  (:types usv ugv uav - robot robot area disaster store cdm box - object)
  (:predicates (anon-have_water_sample-ugv1 ?r - usv ?a - area)
   (anon-box_at-ugv1 ?b - box) (anon-have_picture-ugv1 ?d - disaster)
   (anon-store_of-ugv1 ?s - store) (anon-at-ugv1 ?a - area)
   (in_range ?area - area ?area - area)
   (communicated_data ?disaster - disaster)
   (have_water_sample_cdm ?cdm - cdm ?area - area) (full ?store - store)
   (empty ?store - store) (visible_from ?disaster - disaster ?area - area)
   (ground_path ?area - area ?area - area)
   (water_path ?area - area ?area - area) (box_at_area ?box - box ?area - area)
   (box_at_cdm ?box - box ?cdm - cdm) (cdm_at ?cdm - cdm ?area - area)
   (anon-have_water_sample-uav3 ?r - usv ?a - area)
   (anon-box_at-uav3 ?b - box ?r - ugv) (anon-have_picture-uav3 ?d - disaster)
   (anon-store_of-uav3 ?s - store) (anon-at-uav3 ?a - area)
   (anon-have_water_sample-usv3 ?a - area) (anon-box_at-usv3 ?b - box ?r - ugv)
   (anon-have_picture-usv3 ?d - disaster) (anon-store_of-usv3 ?s - store)
   (anon-at-usv3 ?a - area) (anon-at-usv1 ?a - area)
   (anon-store_of-usv1 ?s - store) (anon-have_picture-usv1 ?d - disaster)
   (anon-box_at-usv1 ?b - box ?r - ugv) (anon-have_water_sample-usv1 ?a - area))

  (:action anon-communicate_data-uav3 :parameters
   (?c - cdm ?d - disaster ?a1 - area ?a2 - area) :precondition
   (and (anon-at-uav3 ?a1) (cdm_at ?c ?a2) (anon-have_picture-uav3 ?d)
        (in_range ?a1 ?a2))
   :effect (and (not (anon-have_picture-uav3 ?d)) (communicated_data ?d)))

  (:action anon-take_picture-uav3 :parameters (?a - area ?d - disaster)
   :precondition (and (visible_from ?d ?a) (anon-at-uav3 ?a)) :effect
   (and (anon-have_picture-uav3 ?d)))

  (:action anon-navigate_uav-uav3 :parameters (?a1 - area ?a2 - area)
   :precondition (and (anon-at-uav3 ?a1)) :effect
   (and (not (anon-at-uav3 ?a1)) (anon-at-uav3 ?a2)))

  (:action anon-communicate_data-usv1 :parameters
   (?c - cdm ?d - disaster ?a1 - area ?a2 - area) :precondition
   (and (anon-at-usv1 ?a1) (cdm_at ?c ?a2) (anon-have_picture-usv1 ?d)
        (in_range ?a1 ?a2))
   :effect (and (not (anon-have_picture-usv1 ?d)) (communicated_data ?d)))

  (:action anon-drop_sample-usv1 :parameters
   (?s - store ?a1 - area ?a2 - area ?c - cdm) :precondition
   (and (anon-store_of-usv1 ?s) (anon-have_water_sample-usv1 ?a2)
        (cdm_at ?c ?a1) (anon-at-usv1 ?a1))
   :effect
   (and (not (full ?s)) (not (anon-have_water_sample-usv1 ?a2))
        (have_water_sample_cdm ?c ?a2) (empty ?s)))

  (:action anon-sample_water-usv1 :parameters (?s - store ?a - area)
   :precondition (and (anon-at-usv1 ?a) (anon-store_of-usv1 ?s) (empty ?s))
   :effect (and (not (empty ?s)) (anon-have_water_sample-usv1 ?a) (full ?s)))

  (:action anon-take_picture-usv1 :parameters (?a - area ?d - disaster)
   :precondition (and (visible_from ?d ?a) (anon-at-usv1 ?a)) :effect
   (and (anon-have_picture-usv1 ?d)))

  (:action anon-navigate_usv-usv1 :parameters (?a1 - area ?a2 - area)
   :precondition (and (anon-at-usv1 ?a1) (water_path ?a1 ?a2)) :effect
   (and (not (anon-at-usv1 ?a1)) (anon-at-usv1 ?a2)))

  (:action anon-navigate_usv-usv3 :parameters (?a1 - area ?a2 - area)
   :precondition (and (anon-at-usv3 ?a1) (water_path ?a1 ?a2)) :effect
   (and (not (anon-at-usv3 ?a1)) (anon-at-usv3 ?a2)))

  (:action anon-take_picture-usv3 :parameters (?a - area ?d - disaster)
   :precondition (and (visible_from ?d ?a) (anon-at-usv3 ?a)) :effect
   (and (anon-have_picture-usv3 ?d)))

  (:action anon-sample_water-usv3 :parameters (?s - store ?a - area)
   :precondition (and (anon-at-usv3 ?a) (anon-store_of-usv3 ?s) (empty ?s))
   :effect (and (not (empty ?s)) (anon-have_water_sample-usv3 ?a) (full ?s)))

  (:action anon-drop_sample-usv3 :parameters
   (?s - store ?a1 - area ?a2 - area ?c - cdm) :precondition
   (and (anon-store_of-usv3 ?s) (anon-have_water_sample-usv3 ?a2)
        (cdm_at ?c ?a1) (anon-at-usv3 ?a1))
   :effect
   (and (not (full ?s)) (not (anon-have_water_sample-usv3 ?a2))
        (have_water_sample_cdm ?c ?a2) (empty ?s)))

  (:action anon-communicate_data-usv3 :parameters
   (?c - cdm ?d - disaster ?a1 - area ?a2 - area) :precondition
   (and (anon-at-usv3 ?a1) (cdm_at ?c ?a2) (anon-have_picture-usv3 ?d)
        (in_range ?a1 ?a2))
   :effect (and (not (anon-have_picture-usv3 ?d)) (communicated_data ?d)))

  (:action anon-navigate_ugv-ugv1 :parameters (?a1 - area ?a2 - area)
   :precondition (and (anon-at-ugv1 ?a1) (ground_path ?a1 ?a2)) :effect
   (and (not (anon-at-ugv1 ?a1)) (anon-at-ugv1 ?a2)))

  (:action anon-take_picture-ugv1 :parameters (?a - area ?d - disaster)
   :precondition (and (visible_from ?d ?a) (anon-at-ugv1 ?a)) :effect
   (and (anon-have_picture-ugv1 ?d)))

  (:action anon-pickup_box-ugv1 :parameters
   (?s - store ?c - cdm ?a - area ?b - box) :precondition
   (and (box_at_cdm ?b ?c) (cdm_at ?c ?a) (anon-at-ugv1 ?a)
        (anon-store_of-ugv1 ?s) (empty ?s))
   :effect
   (and (not (empty ?s)) (not (box_at_cdm ?b ?c)) (anon-box_at-ugv1 ?b)
        (full ?s)))

  (:action anon-drop_box-ugv1 :parameters (?s - store ?a - area ?b - box)
   :precondition
   (and (anon-box_at-ugv1 ?b) (anon-store_of-ugv1 ?s) (anon-at-ugv1 ?a))
   :effect
   (and (not (full ?s)) (not (anon-box_at-ugv1 ?b)) (box_at_area ?b ?a)
        (empty ?s)))

  (:action anon-communicate_data-ugv1 :parameters
   (?c - cdm ?d - disaster ?a1 - area ?a2 - area) :precondition
   (and (anon-at-ugv1 ?a1) (cdm_at ?c ?a2) (anon-have_picture-ugv1 ?d)
        (in_range ?a1 ?a2))
   :effect (and (not (anon-have_picture-ugv1 ?d)) (communicated_data ?d)))
)

; problem
(define (problem obfuscated-codmap-problem-usv1) (:domain floods)
  (:objects box1 box2 box3 - box
             disaster1 disaster2 disaster3 disaster4 disaster5 disaster6 - disaster
             area1 area2 area3 area4 area5 area6 area7 area8 area9 area10 area11 area12 area13 area14 area15 area16 area17 area18 area19 area20 - area
             ugv1store ugv2store ugv3store ugv4store usv1store usv2store usv3store usv4store - store
             cdm1 cdm2 - cdm
            )
  (:init
       (anon-at-ugv1 area1)
       (anon-store_of-ugv1 ugv1store)
       (anon-at-usv3 area13)
       (anon-store_of-usv3 usv3store)
       (in_range area13 area13)
       (in_range area10 area13)
       (in_range area9 area13)
       (in_range area1 area1)
       (in_range area3 area1)
       (in_range area2 area1)
       (visible_from disaster6 area7)
       (visible_from disaster5 area9)
       (visible_from disaster4 area5)
       (visible_from disaster3 area17)
       (visible_from disaster2 area2)
       (visible_from disaster1 area11)
       (ground_path area18 area15)
       (ground_path area15 area18)
       (ground_path area19 area20)
       (ground_path area20 area19)
       (ground_path area20 area18)
       (ground_path area18 area20)
       (ground_path area17 area14)
       (ground_path area14 area17)
       (ground_path area17 area16)
       (ground_path area16 area17)
       (ground_path area16 area15)
       (ground_path area15 area16)
       (ground_path area15 area3)
       (ground_path area3 area15)
       (ground_path area16 area1)
       (ground_path area1 area16)
       (ground_path area13 area10)
       (ground_path area10 area13)
       (ground_path area9 area11)
       (ground_path area11 area9)
       (ground_path area11 area5)
       (ground_path area5 area11)
       (ground_path area8 area7)
       (ground_path area7 area8)
       (ground_path area7 area10)
       (ground_path area10 area7)
       (ground_path area10 area4)
       (ground_path area4 area10)
       (ground_path area6 area4)
       (ground_path area4 area6)
       (ground_path area5 area3)
       (ground_path area3 area5)
       (ground_path area4 area3)
       (ground_path area3 area4)
       (ground_path area3 area1)
       (ground_path area1 area3)
       (water_path area17 area19)
       (water_path area19 area17)
       (water_path area19 area20)
       (water_path area20 area19)
       (water_path area20 area18)
       (water_path area18 area20)
       (water_path area15 area18)
       (water_path area18 area15)
       (water_path area18 area16)
       (water_path area16 area18)
       (water_path area16 area14)
       (water_path area14 area16)
       (water_path area14 area2)
       (water_path area2 area14)
       (water_path area16 area1)
       (water_path area1 area16)
       (water_path area13 area9)
       (water_path area9 area13)
       (water_path area10 area12)
       (water_path area12 area10)
       (water_path area12 area6)
       (water_path area6 area12)
       (water_path area7 area8)
       (water_path area8 area7)
       (water_path area8 area9)
       (water_path area9 area8)
       (water_path area9 area4)
       (water_path area4 area9)
       (water_path area5 area4)
       (water_path area4 area5)
       (water_path area6 area2)
       (water_path area2 area6)
       (water_path area4 area2)
       (water_path area2 area4)
       (water_path area2 area1)
       (water_path area1 area2)
       (box_at_cdm box3 cdm1)
       (box_at_cdm box2 cdm2)
       (box_at_cdm box1 cdm1)
       (anon-at-usv1 area1)
       (cdm_at cdm2 area13)
       (cdm_at cdm1 area1)
       (empty usv4store)
       (empty usv3store)
       (empty usv2store)
       (empty usv1store)
       (empty ugv4store)
       (empty ugv3store)
       (empty ugv2store)
       (empty ugv1store)
       (anon-store_of-usv1 usv1store)
       (anon-at-uav3 area13))
  (:goal (and 
           (have_water_sample_cdm cdm2 area5)
           (have_water_sample_cdm cdm1 area16)
           (have_water_sample_cdm cdm2 area13)
           (box_at_area box3 area11)
           (box_at_area box2 area20)
           (box_at_area box1 area10)
           (communicated_data disaster6)
           (communicated_data disaster5)
           (communicated_data disaster4)
           (communicated_data disaster3)
           (communicated_data disaster2)
           (communicated_data disaster1))))

; plan
1. (anon-pickup_box-ugv1 ugv1store cdm1 area1 box3)
   deleted: (empty ugv1store) (box_at_cdm box3 cdm1)
   added: (anon-box_at-ugv1 box3) (full ugv1store)
   goals met: 0 of 12
2. (anon-navigate_ugv-ugv1 area1 area3)
   deleted: (anon-at-ugv1 area1)
   added: (anon-at-ugv1 area3)
   goals met: 0 of 12
3. (anon-navigate_ugv-ugv1 area3 area5)
   deleted: (anon-at-ugv1 area3)
   added: (anon-at-ugv1 area5)
   goals met: 0 of 12
4. (anon-navigate_ugv-ugv1 area5 area11)
   deleted: (anon-at-ugv1 area5)
   added: (anon-at-ugv1 area11)
   goals met: 0 of 12
5. (anon-drop_box-ugv1 ugv1store area11 box3)
   deleted: (full ugv1store) (anon-box_at-ugv1 box3)
   added: (box_at_area box3 area11) (empty ugv1store)
   goals met: 1 of 12
6. (anon-sample_water-usv3 usv3store area13)
   deleted: (empty usv3store)
   added: (anon-have_water_sample-usv3 area13) (full usv3store)
   goals met: 1 of 12
7. (anon-drop_sample-usv3 usv3store area13 area13 cdm2)
   deleted: (full usv3store) (anon-have_water_sample-usv3 area13)
   added: (have_water_sample_cdm cdm2 area13) (empty usv3store)
   goals met: 2 of 12
8. (anon-navigate_usv-usv1 area1 area16)
   deleted: (anon-at-usv1 area1)
   added: (anon-at-usv1 area16)
   goals met: 2 of 12
9. (anon-sample_water-usv1 usv1store area16)
   deleted: (empty usv1store)
   added: (anon-have_water_sample-usv1 area16) (full usv1store)
   goals met: 2 of 12
10. (anon-navigate_usv-usv1 area16 area1)
   deleted: (anon-at-usv1 area16)
   added: (anon-at-usv1 area1)
   goals met: 2 of 12
11. (anon-drop_sample-usv1 usv1store area1 area16 cdm1)
   deleted: (full usv1store) (anon-have_water_sample-usv1 area16)
   added: (have_water_sample_cdm cdm1 area16) (empty usv1store)
   goals met: 3 of 12
12. (anon-navigate_uav-uav3 area13 area7)
   deleted: (anon-at-uav3 area13)
   added: (anon-at-uav3 area7)
   goals met: 3 of 12
13. (anon-navigate_uav-uav3 area7 area9)
   deleted: (anon-at-uav3 area7)
   added: (anon-at-uav3 area9)
   goals met: 3 of 12
14. (anon-take_picture-uav3 area9 disaster5)
   added: (anon-have_picture-uav3 disaster5)
   goals met: 3 of 12
15. (anon-communicate_data-uav3 cdm2 disaster5 area9 area13)
   deleted: (anon-have_picture-uav3 disaster5)
   added: (communicated_data disaster5)
   goals met: 4 of 12
16. (anon-navigate_uav-uav3 area9 area7)
   deleted: (anon-at-uav3 area9)
   added: (anon-at-uav3 area7)
   goals met: 4 of 12
17. (anon-take_picture-uav3 area7 disaster6)
   added: (anon-have_picture-uav3 disaster6)
   goals met: 4 of 12
18. (anon-navigate_uav-uav3 area7 area9)
   deleted: (anon-at-uav3 area7)
   added: (anon-at-uav3 area9)
   goals met: 4 of 12
19. (anon-communicate_data-uav3 cdm2 disaster6 area9 area13)
   deleted: (anon-have_picture-uav3 disaster6)
   added: (communicated_data disaster6)
   goals met: 5 of 12
20. (anon-navigate_uav-uav3 area9 area5)
   deleted: (anon-at-uav3 area9)
   added: (anon-at-uav3 area5)
   goals met: 5 of 12
21. (anon-take_picture-uav3 area5 disaster4)
   added: (anon-have_picture-uav3 disaster4)
   goals met: 5 of 12
22. (anon-navigate_uav-uav3 area5 area9)
   deleted: (anon-at-uav3 area5)
   added: (anon-at-uav3 area9)
   goals met: 5 of 12
23. (anon-communicate_data-uav3 cdm2 disaster4 area9 area13)
   deleted: (anon-have_picture-uav3 disaster4)
   added: (communicated_data disaster4)
   goals met: 6 of 12
24. (anon-navigate_uav-uav3 area9 area17)
   deleted: (anon-at-uav3 area9)
   added: (anon-at-uav3 area17)
   goals met: 6 of 12
25. (anon-take_picture-uav3 area17 disaster3)
   added: (anon-have_picture-uav3 disaster3)
   goals met: 6 of 12
26. (anon-navigate_uav-uav3 area17 area9)
   deleted: (anon-at-uav3 area17)
   added: (anon-at-uav3 area9)
   goals met: 6 of 12
27. (anon-communicate_data-uav3 cdm2 disaster3 area9 area13)
   deleted: (anon-have_picture-uav3 disaster3)
   added: (communicated_data disaster3)
   goals met: 7 of 12
28. (anon-navigate_uav-uav3 area9 area2)
   deleted: (anon-at-uav3 area9)
   added: (anon-at-uav3 area2)
   goals met: 7 of 12
29. (anon-take_picture-uav3 area2 disaster2)
   added: (anon-have_picture-uav3 disaster2)
   goals met: 7 of 12
30. (anon-communicate_data-uav3 cdm1 disaster2 area2 area1)
   deleted: (anon-have_picture-uav3 disaster2)
   added: (communicated_data disaster2)
   goals met: 8 of 12
31. (anon-take_picture-ugv1 area11 disaster1)
   added: (anon-have_picture-ugv1 disaster1)
   goals met: 8 of 12
32. (anon-navigate_ugv-ugv1 area11 area9)
   deleted: (anon-at-ugv1 area11)
   added: (anon-at-ugv1 area9)
   goals met: 8 of 12
33. (anon-communicate_data-ugv1 cdm2 disaster1 area9 area13)
   deleted: (anon-have_picture-ugv1 disaster1)
   added: (communicated_data disaster1)
   goals met: 9 of 12
34. (anon-navigate_ugv-ugv1 area9 area11)
   deleted: (anon-at-ugv1 area9)
   added: (anon-at-ugv1 area11)
   goals met: 9 of 12
35. (anon-navigate_ugv-ugv1 area11 area5)
   deleted: (anon-at-ugv1 area11)
   added: (anon-at-ugv1 area5)
   goals met: 9 of 12
36. (anon-navigate_ugv-ugv1 area5 area3)
   deleted: (anon-at-ugv1 area5)
   added: (anon-at-ugv1 area3)
   goals met: 9 of 12
37. (anon-navigate_ugv-ugv1 area3 area4)
   deleted: (anon-at-ugv1 area3)
   added: (anon-at-ugv1 area4)
   goals met: 9 of 12
38. (anon-navigate_ugv-ugv1 area4 area10)
   deleted: (anon-at-ugv1 area4)
   added: (anon-at-ugv1 area10)
   goals met: 9 of 12
39. (anon-navigate_ugv-ugv1 area10 area13)
   deleted: (anon-at-ugv1 area10)
   added: (anon-at-ugv1 area13)
   goals met: 9 of 12
40. (anon-pickup_box-ugv1 ugv1store cdm2 area13 box2)
   deleted: (empty ugv1store) (box_at_cdm box2 cdm2)
   added: (anon-box_at-ugv1 box2) (full ugv1store)
   goals met: 9 of 12
41. (anon-navigate_ugv-ugv1 area13 area10)
   deleted: (anon-at-ugv1 area13)
   added: (anon-at-ugv1 area10)
   goals met: 9 of 12
42. (anon-navigate_ugv-ugv1 area10 area4)
   deleted: (anon-at-ugv1 area10)
   added: (anon-at-ugv1 area4)
   goals met: 9 of 12
43. (anon-navigate_ugv-ugv1 area4 area3)
   deleted: (anon-at-ugv1 area4)
   added: (anon-at-ugv1 area3)
   goals met: 9 of 12
44. (anon-navigate_ugv-ugv1 area3 area15)
   deleted: (anon-at-ugv1 area3)
   added: (anon-at-ugv1 area15)
   goals met: 9 of 12
45. (anon-navigate_ugv-ugv1 area15 area18)
   deleted: (anon-at-ugv1 area15)
   added: (anon-at-ugv1 area18)
   goals met: 9 of 12
46. (anon-navigate_ugv-ugv1 area18 area20)
   deleted: (anon-at-ugv1 area18)
   added: (anon-at-ugv1 area20)
   goals met: 9 of 12
47. (anon-drop_box-ugv1 ugv1store area20 box2)
   deleted: (full ugv1store) (anon-box_at-ugv1 box2)
   added: (box_at_area box2 area20) (empty ugv1store)
   goals met: 10 of 12
48. (anon-navigate_usv-usv3 area13 area9)
   deleted: (anon-at-usv3 area13)
   added: (anon-at-usv3 area9)
   goals met: 10 of 12
49. (anon-navigate_usv-usv3 area9 area4)
   deleted: (anon-at-usv3 area9)
   added: (anon-at-usv3 area4)
   goals met: 10 of 12
50. (anon-navigate_usv-usv3 area4 area5)
   deleted: (anon-at-usv3 area4)
   added: (anon-at-usv3 area5)
   goals met: 10 of 12
51. (anon-sample_water-usv3 usv3store area5)
   deleted: (empty usv3store)
   added: (anon-have_water_sample-usv3 area5) (full usv3store)
   goals met: 10 of 12
52. (anon-navigate_usv-usv3 area5 area4)
   deleted: (anon-at-usv3 area5)
   added: (anon-at-usv3 area4)
   goals met: 10 of 12
53. (anon-navigate_usv-usv3 area4 area9)
   deleted: (anon-at-usv3 area4)
   added: (anon-at-usv3 area9)
   goals met: 10 of 12
54. (anon-navigate_usv-usv3 area9 area13)
   deleted: (anon-at-usv3 area9)
   added: (anon-at-usv3 area13)
   goals met: 10 of 12
55. (anon-drop_sample-usv3 usv3store area13 area5 cdm2)
   deleted: (full usv3store) (anon-have_water_sample-usv3 area5)
   added: (have_water_sample_cdm cdm2 area5) (empty usv3store)
   goals met: 11 of 12
56. (anon-navigate_ugv-ugv1 area20 area18)
   deleted: (anon-at-ugv1 area20)
   added: (anon-at-ugv1 area18)
   goals met: 11 of 12
57. (anon-navigate_ugv-ugv1 area18 area15)
   deleted: (anon-at-ugv1 area18)
   added: (anon-at-ugv1 area15)
   goals met: 11 of 12
58. (anon-navigate_ugv-ugv1 area15 area3)
   deleted: (anon-at-ugv1 area15)
   added: (anon-at-ugv1 area3)
   goals met: 11 of 12
59. (anon-navigate_ugv-ugv1 area3 area1)
   deleted: (anon-at-ugv1 area3)
   added: (anon-at-ugv1 area1)
   goals met: 11 of 12
60. (anon-pickup_box-ugv1 ugv1store cdm1 area1 box1)
   deleted: (empty ugv1store) (box_at_cdm box1 cdm1)
   added: (anon-box_at-ugv1 box1) (full ugv1store)
   goals met: 11 of 12
61. (anon-navigate_ugv-ugv1 area1 area3)
   deleted: (anon-at-ugv1 area1)
   added: (anon-at-ugv1 area3)
   goals met: 11 of 12
62. (anon-navigate_ugv-ugv1 area3 area4)
   deleted: (anon-at-ugv1 area3)
   added: (anon-at-ugv1 area4)
   goals met: 11 of 12
63. (anon-navigate_ugv-ugv1 area4 area10)
   deleted: (anon-at-ugv1 area4)
   added: (anon-at-ugv1 area10)
   goals met: 11 of 12
64. (anon-drop_box-ugv1 ugv1store area10 box1)
   deleted: (full ugv1store) (anon-box_at-ugv1 box1)
   added: (box_at_area box1 area10) (empty ugv1store)
   goals met: 12 of 12
